<?php
    require('src/functions.php');

    echo "<h3>Задание №1</h3>";

    task1(['Пример 1', 'Пример 2', 'Пример 3']);

    echo ' --------------------';
    echo task1(['Пример 4', 'Пример 5', 'Пример 6'], true);

 
    echo "<h3>Задание №2</h3>";

    task2('+', 5, 6, 4.5, 555);
    task2('-', 56, 6);
    task2('*', 3, 6 );
    task2('/', 9, 3 );


    echo "<h3>Задание №3</h3>";
    task3(8, 8);

    echo "<h3>Задание №4</h3>";
    task4();
    echo '----------------------------------- <br>';
    task5();

    echo "<h3>Задание №5</h3>";
    task6();
    echo '<br>----------------------------------- <br>';

    task7();


    echo "<h3>Задание №6</h3>";

    task8('file2.txt');
    task9('file2.txt');

